Эвотор/src/InformationRegisters/Эвотор_Заказы/Эвотор_Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Эвотор_Заказы</name>
  <resources>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Эвотор/src/CommonModules/Эвотор_Сервер/Module.bsl
Процедура Эвотор_ПриЗаписиДокумента(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		ЗаказПокупателяПриЗаписи(Источник, Отказ);	
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеВКассу") Тогда
		ПоступлениеВКассуПриЗаписи(Источник, Отказ);	
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацияПоПлатежнымКартам") Тогда
		ОперацияПоПлатежнымКартамПриЗаписи(Источник, Отказ);
		Возврат;	
	КонецЕсли;

КонецПроцедуры

Процедура Эвотор_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// TODO: Вставить содержимое обработчика.
КонецПроцедуры




Процедура ЗаказПокупателяПриЗаписи(Источник, Отказ)
	
	ЗначениеСвойства = УправлениеСвойствами.ЗначениеСвойства(Источник.Ссылка, "ГдеОплачивается_bcd4739824f44ebb9ca53bc674e98b5c");
	Если НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеСвойства.Наименование <> "В магазине" Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.Эвотор_Заказы.ДобавитьЗапись(Источник.Ссылка);

КонецПроцедуры

Процедура ПоступлениеВКассуПриЗаписи(Источник, Отказ)
	


КонецПроцедуры

Процедура ОперацияПоПлатежнымКартамПриЗаписи(Источник, Отказ)
	


КонецПроцедуры

Процедура Эвотор_ВыгрузитьЗаказы() Экспорт

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	Эвотор_Заказы.ЗаказПокупателя,
	|	Эвотор_Заказы.Выгружен,
	|	Эвотор_Заказы.Оплачен
	|ИЗ
	|	РегистрСведений.Эвотор_Заказы КАК Эвотор_Заказы
	|ГДЕ
	|	НЕ Эвотор_Заказы.Выгружен
	|	И НЕ Эвотор_Заказы.Оплачен";

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	// Вставить обработку выборки ВыборкаДетальныеЗаписи
КонецЦикла;

КонецПроцедуры
